// Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа. Обязательна проверка на ввод чисел больше/меньше 3-х знаков


Console.Write("Введите трёх значное число: ");
string n = Console.ReadLine()!;

if(n.Length != 3)
{
    Console.WriteLine("Введено не верное число!");
}
else
{
    Console.WriteLine($"Второе число: {n[1]}");
}